Terraform plan `terraform plan -var 'slo_paths=["catalog/time_slice_slo.yaml"]'`

```
╭─   ~/Code/personal/terraform-datadog-platform/examples/slo on   feat/support-time-slice-slo                                                                                              at  22:57:18 ─╮
╰─❮ terraform plan -var 'slo_paths=["catalog/time_slice_slo.yaml"]'                                                                                                                                          ─╯

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.datadog_slo.datadog_monitor.time_slice_slo_burn_rate_alert["(SLO) Test API p95 latency Checks"] will be created
  + resource "datadog_monitor" "time_slice_slo_burn_rate_alert" {
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = "Burn rate is high enough to deplete error budget in one day"
      + name                = "(SLO Burn Rate Alert) (SLO) Test API p95 latency Checks"
      + new_host_delay      = 300
      + notify_no_data      = false
      + priority            = "2"
      + query               = (known after apply)
      + require_full_window = true
      + tags                = [
          + "env:production",
          + "service:my-service",
        ]
      + type                = "slo alert"

      + monitor_thresholds {
          + critical = "3"
        }
    }

  # module.datadog_slo.datadog_monitor.time_slice_slo_error_budget_alert["(SLO) Test API p95 latency Checks"] will be created
  + resource "datadog_monitor" "time_slice_slo_error_budget_alert" {
      + evaluation_delay    = (known after apply)
      + id                  = (known after apply)
      + include_tags        = true
      + message             = "Alert on 80% of error budget consumed"
      + name                = "(SLO Error Budget Alert) (SLO) Test API p95 latency Checks"
      + new_host_delay      = 300
      + notify_no_data      = false
      + priority            = "2"
      + query               = (known after apply)
      + require_full_window = true
      + tags                = [
          + "env:production",
          + "service:my-service",
        ]
      + type                = "slo alert"

      + monitor_thresholds {
          + critical = "80"
        }
    }

  # module.datadog_slo.datadog_service_level_objective.time_slice_slo["(SLO) Test API p95 latency Checks"] will be created
  + resource "datadog_service_level_objective" "time_slice_slo" {
      + description       = "Test API p95 latency should be less than 1 second."
      + force_delete      = true
      + id                = (known after apply)
      + name              = "(SLO) Test API p95 latency Checks"
      + tags              = [
          + "env:production",
          + "service:my-service",
        ]
      + target_threshold  = (known after apply)
      + timeframe         = (known after apply)
      + type              = "time_slice"
      + warning_threshold = (known after apply)

      + sli_specification {
          + time_slice {
              + comparator             = "<="
              + query_interval_seconds = 300
              + threshold              = 1

              + query {
                  + formula {
                      + formula_expression = "query1 + query2"
                    }
                  + query {
                      + metric_query {
                          + data_source = "metrics"
                          + name        = "query1"
                          + query       = "p95:trace.express.request{env:production,resource_name:get_/api/test,service:my-service}"
                        }
                    }
                  + query {
                      + metric_query {
                          + data_source = "metrics"
                          + name        = "query2"
                          + query       = "p95:trace.express.request{env:production,resource_name:get_/api/test,service:my-service}"
                        }
                    }
                }
            }
        }

      + thresholds {
          + target          = 99
          + target_display  = (known after apply)
          + timeframe       = "30d"
          + warning         = 99.5
          + warning_display = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + datadog_metric_slo_alerts    = {}
  + datadog_metric_slos          = {}
  + datadog_monitor_slo_monitors = {}
  + datadog_monitor_slos         = {}

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't guarantee to take exactly these actions if you run "terraform apply" now.

```